[
  {
    "bookId": 1,
    "bookName": "War",
    "author": "Bob Woodward",
    "image": "https://m.media-amazon.com/images/I/61ZRi-MxTLL._SY425_.jpg",
    "review": "War is an intimate and sweeping account of one of the most tumultuous periods in presidential politics and American history. <br />We see President Joe Biden and his top advisers in tense conversations with Russian president Vladimir Putin, Israeli prime minister Benjamin Netanyahu and Ukrainian president Volodymyr Zelensky. We also see Donald Trump, conducting a shadow presidency and seeking to regain political power.<br />With unrivaled, inside-the-room reporting, Woodward shows President Biden’s approach to managing the war in Ukraine, the most significant land war in Europe since World War II, and his tortured path to contain the bloody Middle East conflict between Israel and the terrorist group Hamas.<br />Woodward reveals the extraordinary complexity and consequence of wartime back-channel diplomacy and decision-making to deter the use of nuclear weapons and a rapid slide into World War III.<br />The raw cage-fight of politics accelerates as Americans prepare to vote in 2024, starting between President Biden and Trump, and ending with the unexpected elevation of Vice President Kamala Harris as the Democratic nominee for president.<br />War provides an unvarnished examination of the vice president as she tries to embrace the Biden legacy and policies while beginning to chart a path of her own as a presidential candidate.<br />Woodward’s reporting once again sets the standard for journalism at its most authoritative and illuminating.",
    "totalPages": 448,
    "rating": 4.4,
    "category": "Nonfiction",
    "tags": ["Nonfiction"],
    "publisher": "Simon & Schuster",
    "yearOfPublishing": 2024
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/stQZrZL/book2.png",
    "review": "A poignant tale of racial injustice and moral growth in the Deep South. Harper Lee's Pulitzer Prize-winning novel, To Kill a Mockingbird, is a powerful exploration of prejudice, compassion, and the complexities of human nature. Set in the fictional town of Maycomb, Alabama, during the 1930s, the story follows young Scout Finch as she learns about empathy and justice from her father, Atticus, who defends a black man falsely accused of raping a white woman. Through Scout's eyes, Lee masterfully addresses themes of racial inequality, social class, and the loss of innocence, creating a timeless masterpiece that continues to resonate with readers today.",
    "totalPages": 324,
    "rating": 4.7,
    "category": "Modern Classic",
    "tags": ["Fiction", "Legal Drama"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/xJWkd16/book3.png",
    "review": "A chilling dystopian vision of a totalitarian future, where freedom is restricted and truth is manipulated. George Orwell's 1984 is a haunting portrayal of a society governed by surveillance, censorship, and propaganda. Set in a dystopian world where individuality is suppressed and dissent is punished, the novel follows Winston Smith, a disillusioned clerk who dares to rebel against the oppressive regime of Big Brother. Through Winston's journey, Orwell explores themes of power, control, and the nature of truth, warning readers of the dangers of totalitarianism and the erosion of personal freedoms.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Dystopian Fiction",
    "tags": ["Fiction", "Political Satire"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/kxbyFtt/book4.png",
    "review": "A charming romantic comedy of manners set in early 19th-century England. Jane Austen's Pride and Prejudice is a timeless tale of love, misunderstandings, and societal expectations. The novel follows the spirited Elizabeth Bennet as she navigates the complexities of romance and class in Regency-era England. Along the way, she encounters the enigmatic Mr. Darcy, whose pride and aloofness initially repel her but eventually give way to a deeper connection. With its sharp wit, memorable characters, and timeless themes, Pride and Prejudice remains one of the most beloved novels in English literature.",
    "totalPages": 279,
    "rating": 4.4,
    "category": "Romance",
    "tags": ["Fiction", "Regency"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "image": "https://i.ibb.co/PzX54kw/book5.png",
    "review": "A seminal novel exploring teenage angst, rebellion, and the search for authenticity. J.D. Salinger's The Catcher in the Rye is a timeless coming-of-age story that captures the alienation and disillusionment of adolescence. Narrated by the rebellious Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. As he encounters various characters and situations, Holden grapples with feelings of isolation, loss, and the desire to preserve innocence in a world he perceives as phony. With its candid portrayal of youth and society, The Catcher in the Rye continues to resonate with readers of all ages.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Coming-of-Age Fiction",
    "tags": ["Fiction", "Cultural"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/DGNyd5d/book6.png",
    "review": "An enchanting adventure filled with dwarves, elves, wizards, and a courageous hobbit on a quest to reclaim treasure from a dragon. J.R.R. Tolkien's The Hobbit is a beloved fantasy novel that transports readers to the magical world of Middle-earth. The story follows Bilbo Baggins, a hobbit who embarks on a grand adventure with a group of dwarves and the wizard Gandalf to reclaim the Lonely Mountain and its treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, goblins, and other fantastical creatures, testing his courage and resourcefulness. With its richly imagined world and memorable characters, The Hobbit is a timeless classic that continues to captivate readers of all ages.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Fiction", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/j6t3MWW/book7.png",
    "review": "A monumental epic fantasy trilogy chronicling the quest to destroy the One Ring and defeat the dark lord Sauron. J.R.R. Tolkien's The Lord of the Rings is a sprawling epic that transports readers to the enchanting world of Middle-earth. Comprising three volumes—The Fellowship of the Ring, The Two Towers, and The Return of the King—the trilogy follows the journey of Frodo Baggins, a humble hobbit tasked with destroying the One Ring, an artifact of immense power that threatens to plunge the world into darkness. Alongside Frodo are a diverse cast of characters, including elves, dwarves, wizards, and men, each playing a crucial role in the battle against the forces of evil. Filled with richly detailed landscapes, intricate mythology, and themes of friendship, courage, and sacrifice, The Lord of the Rings is a timeless masterpiece that continues to captivate readers worldwide.",
    "totalPages": 1178,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Fiction", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 8,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/R3bd4ZL/book8.png",
    "review": "The magical tale of a young wizard, Harry Potter, and his journey through the wizarding world. J.K. Rowling's Harry Potter and the Philosopher's Stone is the enchanting first installment in the beloved Harry Potter series. The story follows Harry Potter, an orphaned boy who discovers he is a wizard on his eleventh birthday and is invited to attend Hogwarts School of Witchcraft and Wizardry. As Harry navigates the challenges of school, he uncovers dark secrets about his past and confronts the evil wizard Voldemort, whose return threatens the wizarding world. Filled with whimsy, adventure, and memorable characters, Harry Potter and the Philosopher's Stone is a magical journey that captures the imagination of readers of all ages.",
    "totalPages": 332,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Fiction", "Magic"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 9,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/8jcgG66/book9.png",
    "review": "A gripping mystery thriller unraveling secrets of the past and hidden codes in famous artworks. Dan Brown's The Da Vinci Code is a fast-paced thriller that takes readers on a thrilling journey through art, history, and conspiracy. When renowned symbologist Robert Langdon is called to investigate a murder at the Louvre Museum in Paris, he uncovers a trail of clues hidden in the works of Leonardo da Vinci. As Langdon and cryptologist Sophie Neveu follow the cryptic clues, they find themselves embroiled in a deadly race against time to uncover a secret that could shake the foundations of Christianity. Packed with twists, turns, and revelations, The Da Vinci Code is a gripping page-turner that will keep readers guessing until the very end.",
    "totalPages": 454,
    "rating": 4.3,
    "category": "Mystery",
    "tags": ["Fiction", "Conspiracy"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  }
]
