[
  {
    "bookId": 1,
    "bookName": "War",
    "author": "Bob Woodward",
    "image": "https://m.media-amazon.com/images/I/61ZRi-MxTLL._SY425_.jpg",
    "review": "War is an intimate and sweeping account of one of the most tumultuous periods in presidential politics and American history.\nWe see President Joe Biden and his top advisers in tense conversations with Russian president Vladimir Putin, Israeli prime minister Benjamin Netanyahu and Ukrainian president Volodymyr Zelensky. We also see Donald Trump, conducting a shadow presidency and seeking to regain political power.\nWith unrivaled, inside-the-room reporting, Woodward shows President Biden’s approach to managing the war in Ukraine, the most significant land war in Europe since World War II, and his tortured path to contain the bloody Middle East conflict between Israel and the terrorist group Hamas.\nWoodward reveals the extraordinary complexity and consequence of wartime back-channel diplomacy and decision-making to deter the use of nuclear weapons and a rapid slide into World War III.\nThe raw cage-fight of politics accelerates as Americans prepare to vote in 2024, starting between President Biden and Trump, and ending with the unexpected elevation of Vice President Kamala Harris as the Democratic nominee for president.\nWar provides an unvarnished examination of the vice president as she tries to embrace the Biden legacy and policies while beginning to chart a path of her own as a presidential candidate.\nWoodward’s reporting once again sets the standard for journalism at its most authoritative and illuminating.",
    "totalPages": 448,
    "rating": 4.4,
    "category": "Nonfiction",
    "tags": ["war", "terrorism", "journalism"],
    "publisher": "Simon & Schuster",
    "yearOfPublishing": 2024,
    "url": "https://www.amazon.com/War-Bob-Woodward/dp/166805227X/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  },
  {
    "bookId": 2,
    "bookName": "Sunrise on the Reaping",
    "author": "Suzanne Collins",
    "image": "https://m.media-amazon.com/images/I/71InK67X-sL._SY425_.jpg",
    "review": "When you've been set up\nto lose everything you love,\nwhat is there left to fight for?\n\nAs the day dawns on the fiftieth annual Hunger Games, fear grips the districts of Panem. This year, in honor of the Quarter Quell, twice as many tributes will be taken from their homes.\nBack in District 12, Haymitch Abernathy is trying not to think too hard about his chances. All he cares about is making it through the day and being with the girl he loves.\nWhen Haymitch's name is called, he can feel all his dreams break. He's torn from his family and his love, shuttled to the Capitol with the three other District 12 tributes: a young friend who's nearly a sister to him, a compulsive oddsmaker, and the most stuck-up girl in town. As the Games begin, Haymitch understands he's been set up to fail. But there's something in him that wants to fight . . . and have that fight reverberate far beyond the deadly arena.",
    "totalPages": 400,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Fiction", "Legal Drama"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2025,
    "url": "https://www.amazon.com/Sunrise-Reaping-Hunger-Games-Novel/dp/1546171460/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  },
  {
    "bookId": 3,
    "bookName": "Good Energy: The Surprising Connection Between Metabolism and Limitless Health ",
    "author": "Casey Means MD",
    "image": "https://m.media-amazon.com/images/I/71KTwO53SnL._SY425_.jpg",
    "review": "What if depression, anxiety, infertility, insomnia, heart disease, erectile dysfunction, type 2 diabetes, Alzheimer’s, dementia, cancer and many other health conditions that torture and shorten our lives actually have the same root cause?\nOur ability to prevent and reverse these conditions - and feel incredible today -  is under our control and simpler than we think. The key is our metabolic function - the most important and least understood factor in our overall health. As Dr. Casey Means explains in this groundbreaking book, nearly every health problem we face can be explained by how well the cells in our body create and use energy. To live free from frustrating symptoms and life-threatening disease, we need our cells to be optimally powered so that they can create “good energy,” the essential fuel that impacts every aspect of our physical and mental wellbeing.\nIf you are battling minor signals of “bad energy” inside your body, it is often a warning sign that more life-threatening illness may emerge later in life. But here’s the good news: for the first time ever, we can monitor our metabolic health in great detail and learn how to improve it ourselves.",
    "totalPages": 400,
    "rating": 4.6,
    "category": "Nonfiction",
    "tags": ["Fiction", "Political Satire"],
    "publisher": "Avery",
    "yearOfPublishing": 2024,
    "url": "https://www.amazon.com/Good-Energy-Surprising-Connection-Metabolism/dp/0593712641/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  },
  {
    "bookId": 4,
    "bookName": "From Here to the Great Unknown: Oprah's Book Club: A Memoir",
    "author": "Lisa Marie Presley",
    "image": "https://m.media-amazon.com/images/I/81wThrp1YyL._SY425_.jpg",
    "review": "In 2022, Lisa Marie Presley asked her daughter to help finally finish her long-gestating memoir.\nA month later, Lisa Marie was dead, and the world would never know her story in her own words, never know the passionate, joyful, caring, and complicated woman that Riley loved and now grieved.\nRiley got the tapes that her mother had recorded for the book, lay in her bed, and listened as Lisa Marie told story after story about smashing golf carts together in the yards of Graceland, about the unconditional love she felt from her father, about being upstairs, just the two of them. About getting dragged screaming out of the bathroom as she ran toward his body on the floor. About living in Los Angeles with her mother, getting sent to school after school, always kicked out, always in trouble. About her singular, lifelong relationship with Danny Keough, about being married to Michael Jackson, what they had in common. About motherhood. About deep addiction. About ever-present grief. Riley knew she had to fulfill her mother’s wish to reveal these memories, incandescent and painful, to the world.\nTo make her mother known.\nThis extraordinary book is written in both Lisa Marie’s and Riley’s voices, a mother and daughter communicating—from this world to the one beyond—as they try to heal each other. Profoundly moving and deeply revealing, From Here to the Great Unknown is a book like no other—the last words of the only child of an American icon.",
    "totalPages": 304,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Fiction", "Regency"],
    "publisher": "Random House",
    "yearOfPublishing": 2024,
    "url": "https://www.amazon.com/Here-Great-Lisa-Marie-Presley/dp/0593733878/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  },
  {
    "bookId": 5,
    "bookName": "Dad, I Want to Hear Your Story: A Father’s Guided Journal To Share His Life & His Love",
    "author": "Jeffrey Mason",
    "image": "https://m.media-amazon.com/images/I/51ZvZFJOsrL._SY425_.jpg",
    "review": "The Gift Your Father Will Enjoy and Appreciate\nDad, I Want to Hear Your Story is the popular and cherished way for Fathers to share the memories and joys of their life while also creating a cherished legacy for you and the entire family.\n\nThis is the Original and Best-Selling Way for Your Dad to Share His Life Story\nDad, I Want to Hear Your Story will guide your Father with prompts and questions, making it fun and easy for him to share the stories of his childhood, teens, and adult years. This will be the tale of his life, his victories, his challenges, and his lessons. You will give your Dad a gift he will cherish while also giving yourself the gift of knowing him a little bit better.\n\nThink of all you will learn about your Dad when you read the stories of his life experiences. What will he share? What will you discover? What will you learn?\n\nImagine Discovering the Details of His Amazing Life and Journey.\nBestselling author Jeffrey Mason and Hear Your Story Books have expertly created this incredibly popular series of guided journals that have helped thousands share their story, chronicle their memories, and create a forever legacy for their families.",
    "totalPages": 106,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Fiction", "Cultural"],
    "publisher": "Independently published",
    "yearOfPublishing": 2019,
    "url": "https://www.amazon.com/Dad-Want-Hear-Your-Story/dp/1070527718/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  },
  {
    "bookId": 6,
    "bookName": "Be Ready When the Luck Happens: A Memoir",
    "author": "Ina Garten",
    "image": "https://m.media-amazon.com/images/I/81g+Hs6XF5L._SY425_.jpg",
    "review": "Here, for the first time, Ina Garten presents an intimate, entertaining, and inspiring account of her remarkable journey. Ina’s gift is to make everything look easy, yet all her accomplishments have been the result of hard work, audacious choices, and exquisite attention to detail. In her unmistakable voice (no one tells a story like Ina), she brings her past and her process to life in a high-spirited and no-holds-barred memoir that chronicles decades of personal challenges, adventures (and misadventures) and unexpected career twists, all delivered with her signature combination of playfulness and purpose.\n\nFrom a difficult childhood to meeting the love of her life, Jeffrey, and marrying him while still in college, from a boring bureaucratic job in Washington, D.C., to answering an ad for a specialty food store in the Hamptons, from the owner of one Barefoot Contessa shop to author of bestselling cookbooks and celebrated television host, Ina has blazed her own trail and, in the meantime, taught millions of people how to cook and entertain. Now, she invites them to come closer to experience her story in vivid detail and to share the important life lessons she learned along the way: do what you love because if you love it you’ll be really good at it, swing for the fences, and always Be Ready When the Luck Happens.",
    "totalPages": 320,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Fiction", "Cultural"],
    "publisher": "Crown",
    "yearOfPublishing": 2024,
    "url": "https://www.amazon.com/Be-Ready-When-Luck-Happens/dp/0593799895/ref=zg_d_sccl_2/138-2626837-4017123?psc=1"
  }
]
